	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 16.0.2.181 Build 20160204";
# mark_description "-march=core-avx2 -std=c11 -g -O3 -Wall -DPRECISION=0 -DLEN=2048 -unroll0 -S -fsource-asm -o assembler/axpy_s";
# mark_description "tride.2k.single.avx2.icc.s";
	.file "axpy_stride.c"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
       .align    16,0x90
	.globl main
# --- main()
main:
..B1.1:                         # Preds ..B1.0

### {

	.cfi_startproc
..___tag_value_main.2:
..L3:
                                                          #229.1
..LN0:
	.file   1 "../axpy_stride.c"
	.loc    1  229  is_stmt 1
        pushq     %rbp                                          #229.1
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #229.1
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #229.1
..LN3:
        pushq     %r12                                          #229.1
..LN4:
        subq      $120, %rsp                                    #229.1
..LN5:
        xorl      %esi, %esi                                    #229.1
..LN6:
        movl      $3, %edi                                      #229.1
..LN7:
        call      __intel_new_feature_proc_init                 #229.1

	.4byte .debug_str+0x1a6
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0xd8
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN507
//	DW_AT_high_pc:
	.8byte ..LN535
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0xd8
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x6c6e
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000061f
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0xd9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN508
//	DW_AT_high_pc:
	.8byte ..LN535
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0xd9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x0000002e
	.byte 0x00
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x13
//	DW_AT_low_pc:
	.8byte ..LN547
//	DW_AT_high_pc:
	.8byte ..LN567
//	DW_AT_abstract_origin:
	.4byte 0x000001a7
//	DW_AT_call_line:
	.byte 0xe0
//	DW_AT_call_column:
	.byte 0x03
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_AT_name:
	.4byte 0x00727261
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x9c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006d7573
//	DW_AT_type:
	.4byte 0x00000514
	.byte 0x00
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xe4
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_AT_name:
	.4byte .debug_str+0x172
	.4byte .debug_str+0x172
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.163
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_inlined_subroutine:
	.byte 0x16
//	DW_AT_ranges:
	.4byte .debug_ranges_seg
//	DW_AT_entry_pc:
	.8byte ..LN86
//	DW_AT_abstract_origin:
	.4byte 0x0000030b
//	DW_AT_call_line:
	.byte 0xe9
//	DW_AT_call_column:
	.byte 0x03
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xcd
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_AT_name:
	.2byte 0x7876
	.byte 0x00
//	DW_TAG_formal_parameter:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xcd
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_AT_name:
	.2byte 0x7976
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0xd0
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x7878
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0xd1
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x7979
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xd3
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x191
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xd3
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a0
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xd3
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a6
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_inlined_subroutine:
	.byte 0x13
//	DW_AT_low_pc:
	.8byte ..LN134
//	DW_AT_high_pc:
	.8byte ..LN155
//	DW_AT_abstract_origin:
	.4byte 0x000001a7
//	DW_AT_call_line:
	.byte 0xe0
//	DW_AT_call_column:
	.byte 0x03
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_AT_name:
	.4byte 0x00727261
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x9c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006d7573
//	DW_AT_type:
	.4byte 0x00000514
	.byte 0x00
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x13
//	DW_AT_low_pc:
	.8byte ..LN18
//	DW_AT_high_pc:
	.8byte ..LN86
//	DW_AT_abstract_origin:
	.4byte 0x00000256
//	DW_AT_call_line:
	.byte 0xe8
//	DW_AT_call_column:
	.byte 0x03
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xbc
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x191
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xbc
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a0
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0xbc
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a6
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_TAG_inlined_subroutine:
	.byte 0x13
//	DW_AT_low_pc:
	.8byte ..LN65
//	DW_AT_high_pc:
	.8byte ..LN86
//	DW_AT_abstract_origin:
	.4byte 0x000001a7
//	DW_AT_call_line:
	.byte 0xc9
//	DW_AT_call_column:
	.byte 0x03
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000050f
//	DW_AT_name:
	.4byte 0x00727261
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x9c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006d7573
//	DW_AT_type:
	.4byte 0x00000514
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000514
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x186
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000520
//	DW_TAG_const_type:
	.byte 0x19
//	DW_AT_type:
	.4byte 0x00000525
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x18c
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x199
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x1e
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x1d2
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1e8
//	DW_AT_type:
	.4byte 0x00000558
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x1fd
//	DW_AT_type:
	.4byte 0x0000056a
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x8b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x1da
//	DW_AT_type:
	.4byte 0x00000563
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1e3
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x1ef
//	DW_AT_type:
	.4byte 0x00000563
//	DW_TAG_subprogram:
	.byte 0x1d
//	DW_AT_decl_line:
	.byte 0xb2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x205
	.4byte .debug_str+0x205
//	DW_AT_frame_base:
	.2byte 0x7702
	.byte 0x00
//	DW_AT_low_pc:
	.8byte ..L58
//	DW_AT_high_pc:
	.8byte ..LNresults.266
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0xb2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_AT_name:
	.4byte .debug_str+0x1c8
//	DW_AT_location:
	.2byte 0x6101
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0xb2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000061f
//	DW_AT_name:
	.4byte .debug_str+0x21a
//	DW_AT_location:
	.2byte 0x5501
//	DW_TAG_formal_parameter:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0xb2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000626
//	DW_AT_name:
	.4byte .debug_str+0x224
//	DW_AT_location:
	.2byte 0x5401
//	DW_TAG_inlined_subroutine:
	.byte 0x16
//	DW_AT_ranges:
	.4byte .debug_ranges_seg+0x60
//	DW_AT_entry_pc:
	.8byte ..LN191
//	DW_AT_abstract_origin:
	.4byte 0x00000087
//	DW_AT_call_line:
	.byte 0xb7
//	DW_AT_call_column:
	.byte 0x33
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x66
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x242
//	DW_AT_type:
	.4byte 0x00000643
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x67
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00727470
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x68
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00667562
//	DW_AT_type:
	.4byte 0x000008a1
//	DW_AT_location:
	.2byte 0x9102
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x68
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x0079656b
//	DW_AT_type:
	.4byte 0x000008ab
//	DW_AT_location:
	.4byte 0x02909103
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x69
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x3ce
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x6a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x23d
//	DW_AT_type:
	.4byte 0x0000052c
//	DW_AT_location:
	.4byte 0x02809103
	.byte 0x00
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x20d
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x21f
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x229
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x0000063e
//	DW_TAG_const_type:
	.byte 0x19
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000648
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x24a
//	DW_AT_type:
	.4byte 0x00000653
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0xf5
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0xd8
//	DW_AT_name:
	.4byte .debug_str+0x24f
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xf6
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x258
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xfb
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x25f
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xfc
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x26c
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x279
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xfe
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x287
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xff
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x296
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0100
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x2a4
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x2b2
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x2bf
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0104
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x2cb
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x2d9
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x2e9
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0108
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x312
//	DW_AT_type:
	.4byte 0x00000815
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x010a
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x68
//	DW_AT_name:
	.4byte .debug_str+0x31b
//	DW_AT_type:
	.4byte 0x0000084d
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x010c
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x70
//	DW_AT_name:
	.4byte .debug_str+0x322
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0110
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x74
//	DW_AT_name:
	.4byte .debug_str+0x32a
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0112
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x78
//	DW_AT_name:
	.4byte .debug_str+0x33a
//	DW_AT_type:
	.4byte 0x00000852
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0116
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01802303
//	DW_AT_name:
	.4byte .debug_str+0x355
//	DW_AT_type:
	.4byte 0x0000085d
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0117
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01822303
//	DW_AT_name:
	.4byte .debug_str+0x361
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0118
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01832303
//	DW_AT_name:
	.4byte .debug_str+0x370
//	DW_AT_type:
	.4byte 0x00000864
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01882303
//	DW_AT_name:
	.4byte .debug_str+0x385
//	DW_AT_type:
	.4byte 0x0000086d
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0125
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01902303
//	DW_AT_name:
	.4byte .debug_str+0x33e
//	DW_AT_type:
	.4byte 0x0000087d
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x012e
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01982303
//	DW_AT_name:
	.4byte .debug_str+0x395
//	DW_AT_type:
	.4byte 0x00000888
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x012f
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01a02303
//	DW_AT_name:
	.4byte .debug_str+0x39c
//	DW_AT_type:
	.4byte 0x00000888
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0130
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01a82303
//	DW_AT_name:
	.4byte .debug_str+0x3a3
//	DW_AT_type:
	.4byte 0x00000888
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0131
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01b02303
//	DW_AT_name:
	.4byte .debug_str+0x3aa
//	DW_AT_type:
	.4byte 0x00000888
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01b82303
//	DW_AT_name:
	.4byte .debug_str+0x3b8
//	DW_AT_type:
	.4byte 0x0000088d
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0134
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01c02303
//	DW_AT_name:
	.4byte .debug_str+0x3bf
//	DW_AT_type:
	.4byte 0x0000002e
//	DW_TAG_member:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x0136
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.4byte 0x01c42303
//	DW_AT_name:
	.4byte .debug_str+0x3c5
//	DW_AT_type:
	.4byte 0x00000898
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x0000081a
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0xa0
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x2f6
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xa1
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x301
//	DW_AT_type:
	.4byte 0x00000815
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xa2
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x307
//	DW_AT_type:
	.4byte 0x0000084d
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0xa6
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x30d
//	DW_AT_type:
	.4byte 0x0000002e
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000653
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x83
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x332
//	DW_AT_type:
	.4byte 0x00000563
//	DW_TAG_base_type:
	.byte 0x18
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x346
//	DW_TAG_array_type:
	.byte 0x1f
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_AT_byte_size:
	.byte 0x01
//	DW_TAG_subrange_type:
	.byte 0x20
//	DW_AT_upper_bound:
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000872
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x37a
//	DW_AT_type:
	.4byte 0x00000525
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x84
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x38b
//	DW_AT_type:
	.4byte 0x00000563
//	DW_TAG_pointer_type:
	.byte 0x17
//	DW_AT_type:
	.4byte 0x00000525
//	DW_TAG_typedef:
	.byte 0x1c
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x3b1
//	DW_AT_type:
	.4byte 0x00000632
//	DW_TAG_array_type:
	.byte 0x1f
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_AT_byte_size:
	.byte 0x14
//	DW_TAG_subrange_type:
	.byte 0x20
//	DW_AT_upper_bound:
	.byte 0x13
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_AT_byte_size:
	.2byte 0x0100
//	DW_TAG_subrange_type:
	.byte 0x20
//	DW_AT_upper_bound:
	.byte 0xff
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x1f
//	DW_AT_type:
	.4byte 0x0000062b
//	DW_AT_byte_size:
	.byte 0x0b
//	DW_TAG_subrange_type:
	.byte 0x20
//	DW_AT_upper_bound:
	.byte 0x0a
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x22
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0078
//	DW_AT_type:
	.4byte 0x000008c8
//	DW_AT_location:
	.2byte 0x0309
	.8byte x
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000514
//	DW_AT_byte_size:
	.2byte 0x2000
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.2byte 0x07ff
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x22
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0079
//	DW_AT_type:
	.4byte 0x000008e7
//	DW_AT_location:
	.2byte 0x0309
	.8byte y
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000514
//	DW_AT_byte_size:
	.2byte 0x2000
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.2byte 0x07ff
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x22
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x007a
//	DW_AT_type:
	.4byte 0x00000906
//	DW_AT_location:
	.2byte 0x0309
	.8byte z
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000514
//	DW_AT_byte_size:
	.2byte 0x2000
//	DW_TAG_subrange_type:
	.byte 0x23
//	DW_AT_upper_bound:
	.2byte 0x07ff
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x24
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x405
//	DW_AT_type:
	.4byte 0x00000514
//	DW_AT_location:
	.2byte 0x0309
	.8byte alpha
//	DW_AT_external:
	.byte 0x01
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x55
	.byte 0x06
	.byte 0x10
	.byte 0x06
	.2byte 0x0000
	.byte 0x02
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x08
